using UnityEngine;

using Entrance.Common;
using Entrance.Model;
using Entrance.View;

using UniRx;

namespace Entrance.Prezenter
{
    public class LivePreparationPrezenter : BaseScreenPrezenter
    {
        // **************************************************
        // View
        // **************************************************
        [SerializeField]
        private LivePreparationView livePreparationView = default;

        // **************************************************
        // Model
        // **************************************************
        private LivePreparationModel livePreparationModel = new LivePreparationModel();

        // ********************************************************************************
        // 初期化時に呼ばれます
        // ********************************************************************************
        public override void Initialize()
        {
            // ********************************************************************************
            // Viewの初期化（UIをアニメーション前の状態にする）
            // ********************************************************************************
            livePreparationView.Initialize(sessionCommon);

            // ********************************************************************************
            // 追加で生成するべきUIパーツの生成と配置
            // ********************************************************************************

            // ********************************************************************************
            // Bind処理（Modelの値の変更の監視設定）
            // ********************************************************************************
            // 準備管理番号
            livePreparationModel.PreparationNumber
                .Subscribe(livePreparationView.SelectPreparation)
                .AddTo(gameObject);

            // ********************************************************************************
            // SetEvents処理（Viewのイベントの監視設定）
            // ********************************************************************************
            // 準備選択イベント
            livePreparationView.selectPreparationListener1 = () => livePreparationModel.SelectPreparation(1);
            livePreparationView.selectPreparationListener2 = () => livePreparationModel.SelectPreparation(2);
            livePreparationView.selectPreparationListener3 = () => livePreparationModel.SelectPreparation(3);
            livePreparationView.selectPreparationListener4 = () => livePreparationModel.SelectPreparation(4);
            livePreparationView.selectPreparationListener5 = () => livePreparationModel.SelectPreparation(5);
            // 準備決定イベント
            livePreparationView.decideListener = () =>
            {
                switch (livePreparationModel.PreparationNumber.Value)
                {
                    case 1:
                        // 次画面へ遷移
                        screenDataLinkage.Value = new ScreenDataLinkage(ScreenList.MusicGameScreen, sessionCommon);
                        break;
                    case 2:
                        // 次画面へ遷移
                        screenDataLinkage.Value = new ScreenDataLinkage(ScreenList.SettingNotesSpeed, sessionCommon);
                        break;
                    case 3:
                        // 次画面へ遷移
                        screenDataLinkage.Value = new ScreenDataLinkage(ScreenList.SettingSevereLevel, sessionCommon);
                        break;
                    case 4:
                        // 次画面へ遷移
                        screenDataLinkage.Value = new ScreenDataLinkage(ScreenList.SettingTiming, sessionCommon);
                        break;
                }
            };
            // キャンセルイベント
            livePreparationView.cancelListener = () =>
            {
                // 次画面へ遷移
                screenDataLinkage.Value = new ScreenDataLinkage(ScreenList.SelectDifficultScreen, sessionCommon);
            };

            // ********************************************************************************
            // 画面の描画に必要な追加通信
            // ********************************************************************************
        }

        // ********************************************************************************
        // OnScreenOepnの直前に呼ばれます
        // ********************************************************************************
        public override void OnScreenOepnBefore()
        {
            // ********************************************************************************
            // InitializeとOnScreenOepnBeforeの間で、前のScreenからパラメータが必要に応じて渡されてきています。
            // ********************************************************************************

            // ********************************************************************************
            // ここでは、初期化後に渡されたパラメータに応じて、画面が表示される前に済ませておきたい処理を行う
            // ********************************************************************************

            // ********************************************************************************
            // 渡されたパラメータをModelに適応
            // ********************************************************************************

            // ********************************************************************************
            // 渡されたパラメータに依存した追加UI生成
            // ********************************************************************************

            // ********************************************************************************
            // 渡されたパラメータに依存した追加通信
            // ********************************************************************************
        }

        // ********************************************************************************
        // 自身に遷移してくる際に呼ばれます
        // ********************************************************************************
        public override void OnScreenOepn()
        {
            // ********************************************************************************
            // UIを表示するアニメーションの再生
            // ********************************************************************************
        }

        // ********************************************************************************
        // OnScreenOepnの直後に呼ばれます
        // ********************************************************************************
        public override void OnScreenOepnAfter()
        {
            // ********************************************************************************
            // 特になし
            // ********************************************************************************
        }

        // ********************************************************************************
        // 次のScreenに遷移する際に呼ばれます
        // ********************************************************************************
        public override void OnScreenChange()
        {
            // ********************************************************************************
            // UIを非表示にするアニメーションの再生
            // ********************************************************************************
        }

        // ********************************************************************************
        // 前のScreenに戻る際に読まれます
        // ********************************************************************************
        public override void OnScreenBackSrc()
        {
            // ********************************************************************************
            // UIを非表示にするアニメーションの再生
            // ********************************************************************************
        }

        // ********************************************************************************
        // OnScreenBackDstの直前に呼ばれます
        // ********************************************************************************
        public override void OnScreenBackDstBefore()
        {
            // ********************************************************************************
            // 設定を表示
            // ********************************************************************************
            livePreparationView.DisplaySetting(sessionCommon);
        }

        // ********************************************************************************
        // 戻るによって自身に遷移してくる際に呼ばれます
        // ********************************************************************************
        public override void OnScreenBackDst()
        {
            // ********************************************************************************
            // UIを表示するアニメーションの再生
            // ********************************************************************************
        }

        // ********************************************************************************
        // 自身を管理しているWindowが閉じる際に呼ばれます
        // ********************************************************************************
        public override void OnWindowClose()
        {
            // ********************************************************************************
            // 特になし
            // ********************************************************************************
        }

        // ********************************************************************************
        // Androidバックキーが押された際に呼ばれます
        // ********************************************************************************
        public override void AndroidBack()
        {
            // ********************************************************************************
            // 特になし
            // ********************************************************************************
        }
    }
}
