namespace Entrance.Common
{
    public enum ScreenList
    {
        // **************************************************
        // タイトルウィンドウ
        // **************************************************
        // タイトルスクリーン
        TitleScreen,

        // **************************************************
        // 選択ウィンドウ
        // **************************************************
        // 楽曲選択スクリーン
        SelectMusicScreen,
        // 難易度選択スクリーン
        SelectDifficultScreen,
        // 準備選択スクリーン
        SelectPreparationScreen,
        // ノーツスピード設定スクリーン
        SettingNotesSpeed,
        // シビアレベル設定スクリーン
        SettingSevereLevel,
        // タイミング設定スクリーン
        SettingTiming,

        // **************************************************
        // ライブウィンドウ
        // **************************************************
        // ライブスクリーン
        MusicGameScreen,
        // リザルトスクリーン
        ResultScreen
    }
}
